//Identifies when Copilot for Security SCUs have been created or changed in the AzureActivity table

AzureActivity
| where OperationNameValue == "MICROSOFT.SECURITYCOPILOT/CAPACITIES/WRITE"
| where ActivityStatusValue == "Success"
| project Caller, CallerIpAddress, ResourceGroup
